app/Controllers/Buku.php

    public function index(){
        $current = $this->request->getVar('page_buku') ? $this->request->getVar('page_buku') : 1; // ubah 1
        $cari = $this->request->getVar('cari');
        if($cari){
            $buku = $this->BukuModel->cari($cari);
        }else{
            $buku = $this->BukuModel->getBuku();
        }

        $data = [
            'title' => 'Daftar Buku',
            'buku' => $this->BukuModel->paginate(2, 'buku'), // ubah 2
---
SELECT *
FROM `buku`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `buku`

    $fileSampul->move('img', $namaSampul);

    // Simpan data ke database
    $this->BukuModel->save([
        'judul'        => $this->request->getVar('judul'),
        'pengarang'    => $this->request->getVar('pengarang'),
        'penerbit'     => $this->request->getVar('penerbit'),
        'tahun_terbit' => $this->request->getVar('tahun_terbit'),
        'sampul'       => $namaSampul
    ]);
---
INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`, `sampul`) VALUES ('si kancil nyuri timun', 'Tama', 'Gramedia', '2005', 'bamboo-150004_1280.png')

    public function hapus($idbuku){
        $this->BukuModel->delete($idbuku);
---
DELETE FROM `buku`
WHERE `id_buku` IN ('3')

        }

        // Simpan data yang diperbarui ke database
        $this->BukuModel->save([
            'id_buku' => $idbuku,
            'judul' => $this->request->getVar('judul'),
            'pengarang' => $this->request->getVar('pengarang'),
            'penerbit' => $this->request->getVar('penerbit'),
            'tahun_terbit' => $this->request->getVar('tahun_terbit'),
            'sampul' => $namaSampul
        ]);
---
UPDATE `buku` SET `judul` = 'Pendekar Hana', `pengarang` = 'Pratama Putra', `penerbit` = 'Kompasiana', `tahun_terbit` = '2025', `sampul` = 'bumi.jpg'
WHERE `buku`.`id_buku` IN ('1')