app/Models/BukuModel.php

    public function getBuku($idbuku = false){
        if($idbuku == false){
            return $this->findAll();
        }
            return $this->where(['id_buku' => $idbuku])->first();
---
SELECT *
FROM `buku`
SELECT *
FROM `buku`
WHERE `id_buku` = '1'
 LIMIT 1